["Больше часа, меньше минуты.\n\nОтвет: .)хасач ан аклертс( аднукеС","На каком языке говорят молча?\n\nОтвет: .вотсеж кызЯ","Мальчик заплатил за бутылку с пробкой 11 рублей. Бутылка стоит на 10 рублей больше, чем пробка. Сколько стоит пробка?\n\nОтвет: .кеепок 05","В каком городе спрятались мужское имя и сторона света?\n\nОтвет: .котсовидалВ","Семь сестер находятся на даче, где каждая занята каким-то делом. Первая сестра читает книгу, вторая — готовит еду, третья — играет в шахматы, четвертая — разгадывает судоку, пятая — занимается стиркой, шестая — ухаживает за растениями. А чем занимается седьмая сестра?\n\nОтвет: .ытамхаш в теаргИ","По чему ходят часто, а ездят редко?\n\nОтвет: .ецинтсел оП","Идет то в гору, то с горы, но остается на месте.\n\nОтвет: .агороД","Ничего не пишите и не используйте калькулятор. Возьмите 1000. Прибавьте 40. Прибавьте еще тысячу. Прибавьте 30. Еще 1000. Плюс 20. Плюс 1000. И плюс 10. Что получилось?\n\nОтвет: .еротялукьлак ан ьтатичсереп етйуборпоП .0014 тевто йыньливарП .онревеН ?0005","Как человеку не спать 8 дней?\n\nОтвет: .мачон оп ьтапС","Стоит богатый дом и бедный. Они горят. Какой дом будет тушить полиция?\n\nОтвет: .еынражоп ташут ыражоп ,тишут ен ыражоп яицилоП","Где на Земле дует всегда южный ветер?\n\nОтвет: .есюлоп монревеС аН","В каком числе цифр столько, сколько букв в его названии?\n\nОтвет: .)ноиллим( 0000001 ,)отс( 001","Ночной сторож умер днём. Дадут ли ему пенсию?\n\nОтвет: .анжун ен яиснеп умовтреМ","У отца Мэри есть 5 дочерей: Чача, Чичи, Чече, Чочо. Как зовут 5 дочь?\n\nОтвет: .ирэМ","К тебе пришли гости, а в холодильнике — бутылка лимонада, пакет с ананасовым соком и бутылка минеральной воды. Что ты откроешь в первую очередь?\n\nОтвет: .киньлидолоХ","Завязать можно, а развязать нельзя.\n\nОтвет: .ровогзаР","Какой пробкой нельзя заткнуть ни одну бутылку?\n\nОтвет: .йонжороД","Вы опередили лыжника, который находился на второй позиции. Какое месте теперь Вы занимаете?\n\nОтвет: .еоротВ","В отеле 7 этажей. На первом разместились четыре человека, на каждом последующем - на 2 больше, чем на предыдущем. На каком этаже отеля чаще всего вызывают лифт?\n\nОтвет: .мовреп аН","Батон разрезали на три части. Сколько сделали разрезов?\n\nОтвет: .авД","Кто ходит сидя?\n\nОтвет: .тситамхаШ","Что всегда увеличивается и никогда не уменьшается?\n\nОтвет: .тсарзоВ","Чем больше из неё берёшь, тем больше становится... Что это?\n\nОтвет: .амЯ","Когда чёрной кошке лучше всего пробраться в дом?\n\nОтвет: .атыркто ьревд адгоК","В каком месяце 28 дней?\n\nОтвет: .йенд 82 ьтсе ецясем моджак В","Что сырым не едят, а сварят - выбросят?\n\nОтвет: .тсил йыворваЛ","Какой месяц короче всех?\n\nОтвет: .)ывкуб ирт( йаМ","Что станет с красным мячиком, если он упадёт в Чёрное море?\n\nОтвет: .тенкоман нО","Какой рукой лучше размешивать чай?\n\nОтвет: .йокжол ьтавишемзар ешчуЛ","На какой вопрос нельзя ответить \"да\"?\n\nОтвет: \"?ьшипс ыТ\"","Сколько яиц можно съесть натощак?\n\nОтвет: .кащотан ен ежу онедеъс тедуб еоньлатсо есВ .ондО","Тебе дано, а люди пользуются. Что это?\n\nОтвет: .ямИ","Может ли страус назвать себя птицей?\n\nОтвет: .ьтировог теему ен но как кат ,теН","Мужчина ехал в машине. Фары он не включил, луны тоже не было, фонари вдоль дороги не светили. Перед машиной дорогу стала переходить старушка, но водитель вовремя затормозил, и аварии не произошло. Как ему удалось разглядеть старушку?\n\nОтвет: .ьнед лыБ","Что можно увидеть с закрытыми глазами?\n\nОтвет: .ноС","Летела стая уток: две впереди, две позади, одна посередине и три в ряд. Сколько их всего?\n\nОтвет: .ирТ"]